# Напишите программу, которая найдёт 
# произведение пар чисел списка. Парой 
# считаем первый и последний элемент, 
# второй и предпоследний и т.д.

# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16]
# [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6]
print(list)
result = []
left = 0
while left < len(list)/2:
    right = (left + 1) * -1
    result.append(list[left]*list[right])
    left += 1
print(result)